; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v13 ?v11)
             (pred_1 ?v5 ?v10)
             (pred_5 ?v13 ?v10)
             (pred_4 ?v4 ?v13 )
	     (pred_11 ?v13)
             (pred_3 ?v7)
             (pred_7 ?v5)
             (pred_2 ?v10)
             (pred_12 ?v13)
             (pred_8 ?v5)
             (pred_10 ?v13)
             (pred_6 ))



(:action op_1
:parameters (?v1 ?v3 ?v9 ?v2)
:precondition (and (pred_3 ?v1) (pred_3 ?v3) (pred_7 ?v9) (pred_2 ?v2)
          (pred_9 ?v1 ?v3) (pred_1 ?v9 ?v2)
                   (pred_5 ?v3 ?v2) (pred_11 ?v1) 
                   (pred_12 ?v3) (pred_8 ?v9))
:effect (and  (pred_10 ?v3) (not (pred_12 ?v3))))


(:action op_2
:parameters (?v1 ?v6)
:precondition (and (pred_3 ?v1) (pred_3 ?v6)
               (pred_11 ?v1) (pred_9 ?v1 ?v6) (pred_10 ?v6))
:effect (and (pred_11 ?v6) (not (pred_11 ?v1))))

(:action op_5
:parameters (?v1 ?v9)
:precondition (and (pred_3 ?v1) (pred_7 ?v9) 
                  (pred_11 ?v1) (pred_4 ?v9 ?v1) (pred_6 ))
:effect (and (pred_8 ?v9)
   (not (pred_4 ?v9 ?v1)) (not (pred_6 ))))


(:action op_4
:parameters (?v1 ?v8 ?v12)
:precondition (and (pred_3 ?v1) (pred_7 ?v8) (pred_7 ?v12)
                  (pred_11 ?v1) (pred_8 ?v12) (pred_4 ?v8 ?v1))
:effect (and (pred_8 ?v8) (pred_4 ?v12 ?v1)
        (not (pred_8 ?v12)) (not (pred_4 ?v8 ?v1))))

(:action op_3
:parameters (?v1 ?v9)
:precondition (and (pred_3 ?v1) (pred_7 ?v9) 
                  (pred_11 ?v1) (pred_8 ?v9))
:effect (and (pred_6 ) (pred_4 ?v9 ?v1) (not (pred_8 ?v9)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_01 obj_12 obj_13 obj_06 obj_09 obj_17 obj_03 obj_14 obj_18 obj_07 obj_05 obj_04 obj_15 obj_11 obj_02 obj_20
    obj_08 obj_16
    obj_19 obj_10
    )

    (:init
       (pred_6)

       (pred_3 obj_01)
       (pred_3 obj_12)
       (pred_3 obj_13)
       (pred_3 obj_06)
       (pred_3 obj_09)
       (pred_3 obj_17)
       (pred_3 obj_03)
       (pred_3 obj_14)
       (pred_3 obj_18)
       (pred_3 obj_07)
       (pred_3 obj_05)
       (pred_3 obj_04)
       (pred_3 obj_15)
       (pred_3 obj_11)
       (pred_3 obj_02)
       (pred_3 obj_20)
       (pred_2 obj_08)
       (pred_2 obj_16)
       (pred_7 obj_19)
       (pred_7 obj_10)

       (pred_9 obj_01 obj_09)
       (pred_9 obj_01 obj_12)
       (pred_9 obj_12 obj_17)
       (pred_9 obj_12 obj_13)
       (pred_9 obj_12 obj_01)
       (pred_9 obj_13 obj_03)
       (pred_9 obj_13 obj_06)
       (pred_9 obj_13 obj_12)
       (pred_9 obj_06 obj_14)
       (pred_9 obj_06 obj_13)
       (pred_9 obj_09 obj_18)
       (pred_9 obj_09 obj_17)
       (pred_9 obj_09 obj_01)
       (pred_9 obj_17 obj_07)
       (pred_9 obj_17 obj_03)
       (pred_9 obj_17 obj_12)
       (pred_9 obj_17 obj_09)
       (pred_9 obj_03 obj_05)
       (pred_9 obj_03 obj_14)
       (pred_9 obj_03 obj_13)
       (pred_9 obj_03 obj_17)
       (pred_9 obj_14 obj_04)
       (pred_9 obj_14 obj_06)
       (pred_9 obj_14 obj_03)
       (pred_9 obj_18 obj_15)
       (pred_9 obj_18 obj_07)
       (pred_9 obj_18 obj_09)
       (pred_9 obj_07 obj_11)
       (pred_9 obj_07 obj_05)
       (pred_9 obj_07 obj_17)
       (pred_9 obj_07 obj_18)
       (pred_9 obj_05 obj_02)
       (pred_9 obj_05 obj_04)
       (pred_9 obj_05 obj_03)
       (pred_9 obj_05 obj_07)
       (pred_9 obj_04 obj_20)
       (pred_9 obj_04 obj_14)
       (pred_9 obj_04 obj_05)
       (pred_9 obj_15 obj_11)
       (pred_9 obj_15 obj_18)
       (pred_9 obj_11 obj_02)
       (pred_9 obj_11 obj_07)
       (pred_9 obj_11 obj_15)
       (pred_9 obj_02 obj_20)
       (pred_9 obj_02 obj_05)
       (pred_9 obj_02 obj_11)
       (pred_9 obj_20 obj_04)
       (pred_9 obj_20 obj_02)
       (pred_12 obj_01)
       (pred_12 obj_04)
       (pred_5  obj_01 obj_08)
       (pred_5  obj_04 obj_16)
       (pred_10 obj_12)
       (pred_10 obj_13)
       (pred_10 obj_06)
       (pred_10 obj_09)
       (pred_10 obj_17)
       (pred_10 obj_03)
       (pred_10 obj_14)
       (pred_10 obj_18)
       (pred_10 obj_07)
       (pred_10 obj_05)
       (pred_10 obj_15)
       (pred_10 obj_11)
       (pred_10 obj_02)
       (pred_10 obj_20)

       (pred_1  obj_19 obj_08)
       (pred_1  obj_10 obj_16)
       (pred_4 obj_19 obj_17)
       (pred_4 obj_10 obj_14)
       (pred_11 obj_15)
    )

    (:goal (and
       (pred_4 obj_10 obj_04)
    ))
(:constraints
  (always (not (pred_11 obj_03)))
)
)

; plan
1. (op_2 obj_15 obj_18)
   deleted: (pred_11 obj_15)
   added: (pred_11 obj_18)
   goals met: 0 of 1
2. (op_2 obj_18 obj_09)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_09)
   goals met: 0 of 1
3. (op_2 obj_09 obj_17)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_17)
   goals met: 0 of 1
4. (op_2 obj_17 obj_12)
   deleted: (pred_11 obj_17)
   added: (pred_11 obj_12)
   goals met: 0 of 1
5. (op_2 obj_12 obj_13)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_13)
   goals met: 0 of 1
6. (op_2 obj_13 obj_06)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_06)
   goals met: 0 of 1
7. (op_2 obj_06 obj_14)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_14)
   goals met: 0 of 1
8. (op_5 obj_14 obj_10)
   deleted: (pred_4 obj_10 obj_14) (pred_6)
   added: (pred_8 obj_10)
   goals met: 0 of 1
9. (op_1 obj_14 obj_04 obj_10 obj_16)
   deleted: (pred_12 obj_04)
   added: (pred_10 obj_04)
   goals met: 0 of 1
10. (op_2 obj_14 obj_04)
   deleted: (pred_11 obj_14)
   added: (pred_11 obj_04)
   goals met: 0 of 1
11. (op_3 obj_04 obj_10)
   deleted: (pred_8 obj_10)
   added: (pred_6) (pred_4 obj_10 obj_04)
   goals met: 1 of 1
